Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/atdf/PIC32CK1025SG00064.atdf
        <register name="XCON2" offset="0x104" rw="RW" size="4" initval="0x000000A0" caption="SPI XIP Control2 register">
          <bitfield name="MODECODE" caption="8bit value for Mode byte" mask="0xFF"/>
          <bitfield name="MODEBYTES" caption="Mode Bytes 00 - 0 Mode Bytes , 01 - 1 Mode Byte , 10 - 2 Mode Bytes , 11 - 3 Mode Bytes" mask="0x300"/>
          <bitfield name="DEVSEL" caption="XIP SPI Device Select: This field is used to select a particular SPI device 000 - Select Device0 , 001 - Select Device1 , 010 - Select Device2 , 011 - Select Device3 , 100 - Select Device4 , 101 - Select Device5 , 110 - Select Device6 , 111 - Select Device7" mask="0x1C00"/>
        </register>
        <register name="CFG" offset="0x108" rw="RW" size="4" initval="0x01007E01" caption="SPI Configuration Register">
          <bitfield name="MODE" caption="Mode Select The default value of this field is 0. After power on reset, the controller enters boot mode. 000 - Boot mode. The CSR registers are loaded with boot strap values. 001 - PIO mode. The controller is controlled by the CPU in PIO mode. 010 - DMA mode.  011 - XIP mode. When this mode is entered the controller behaves as if executing in Place (XIP) but uses the register data to control timing. 100 - 111 - Reserved" mask="0x7"/>
          <bitfield name="CPHA" caption="Clock phase (selects the transfer format) 0 = SPICLK starts toggling at the middle of 1st data bit. 1 = SPICLK starts toggling at the start of 1st data bit." mask="0x8"/>
          <bitfield name="CPOL" caption="Clock polarity 0 = active-high SPICLK (SPICLK low is the idle state) 1 = active-low SPICLK (SPICLK high is the idle state)" mask="0x10"/>
          <bitfield name="LSBF" caption="Data format on SPI interface  0 = MSBit sent/received first. 1 = LSBit sent/received first.  This setting is supeceded by LSBF control bit in Buffer Descriptor during DMA operations." mask="0x20"/>
          <bitfield name="WP" caption="Write Protect: In single or Dual lane mode, this bit is used to drive the spiout2 signal. Whenever this bit is high, the controller drives 0 on spiout2 line and sets spimoe2 high (active only during transfer)." mask="0x200"/>
          <bitfield name="HOLD" caption="Hold: In Single or Dual lane mode, this bit is used to drive the spiout3 signal. Whenever this bit is high, the controller drives 0 on spiout3 line and sets spimoe3 high (active only during transfer)." mask="0x400"/>
          <bitfield name="BURSTEN" caption="This field is used to configure the AHB Master Burst capability. 1 - AHB INCR is enabled 0 - AHB INCR is disabled" mask="0x800"/>
          <bitfield name="AHB_BURST_INCR4_EN" caption="This field is used to configure the AHB Master Burst capability. 1 - AHB INCR4 is enabled. 0 - AHB INCR4 is disabled" mask="0x1000"/>
          <bitfield name="AHB_BURST_INCR8_EN" caption="This field is used to configure the AHB Master Burst capability. 1 - AHB INCR8 is enabled. 0 - AHB INCR8 is disabled" mask="0x2000"/>
          <bitfield name="AHB_BURST_INCR16_EN" caption="This field is used to configure the AHB Master Burst capability.  1 - AHB INCR16 is enabled.  0 - AHB INCR16 is disabled" mask="0x4000"/>
          <bitfield name="TXBUFRST" caption="Transmit FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Transmit FIFO pointers will get reset by this reset pulse. Note: Transmit FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during  transaction, we need to go for soft reset only.Note: For Michigan Ax versions, treat as Reserved, keep 0." mask="0x20000"/>
          <bitfield name="RXBUFRST" caption="Receive FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Receive fifo pointers will get reset by this reset pulse. Note: Receive FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0." mask="0x40000"/>
          <bitfield name="CONBUFRST" caption="Control FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Control fifo pointers will get reset by this reset pulse. Note: Control FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0." mask="0x80000"/>
          <bitfield name="DATAEN" caption="Max Data Lanes 11 - Reserved, 10 - 4, 01 - 2, 00 - 1 SPI_OUT_PIN_EN[3:0] output pins are controlled by writing to these bits." mask="0x300000"/>
          <bitfield name="SQIEN" caption="1 - Enabled, 0 - Disabled SPI_ON output pin is controlled by writing to  this bit." mask="0x800000"/>
          <bitfield name="CSEN" caption="1 - Chip Select is used 0 - Chip Select is not used SPI_CS[7] for  CS7, SPI_CS[6] for  CS6, SPI_CS[5] for  CS5, SPI_CS[4] for  CS4, SPI_CS[3] for  CS3, SPI_CS[2] for  CS2, SPI_CS[1] for  CS1, SPI_CS[0] for  CS0. SPI_CS_PIN_EN[7:0/3:0] output pins are  controlled by writing to these bits." mask="0xFF000000"/>
        </register>
        <register name="CON" offset="0x10C" rw="RW" size="4" initval="0x00000000" caption="SPI Control register">
          <bitfield name="TXRXCOUNT" caption="This bit specifies the total number of bytes to transmit or receive (based on CMD_INIT field). ,16?d 0 - Reserved,16?d 1 - 1byte to transmit/receive ,16?d 2 - 2bytes to transmit/receive NOTE: Count must be programmed to non-zero value prior to initiating transaction" mask="0xFFFF"/>
          <bitfield name="CMDINIT" caption="This signal indicates the command initiation mode. If it is Transmit, Commands are initiated based on writes to transmit register or the contents of TX FIFO. If the CMD_INIT is Receive, commands are initiated based on reads to Read register or RX FIFO availability. 00 = Reserved.  01 = Initiate Transmit.  10 = Initiate Receive. 11 = Reserved.  Note: If Boot mode is enabled, the default value  is 2?b10  This is NOT active status field, see SPI Status2 Reg (0x30)" mask="0x30000"/>
          <bitfield name="LANEMODE" caption="SPI Lane mode 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use" mask="0xC0000"/>
          <bitfield name="DEVSEL" caption="SPI Device Select: This field along with bit25 is used to select a particular SPI device. Note: For Michigan Ax versions, extension by bit25 is NOT used (only 4 devices are selectable, by bits 21:20 here)." mask="0x300000"/>
          <bitfield name="DASSERT" caption="Chip Select Assert 0 - CS is not de-asserted after transmission/reception of specified number of bytes in the control register 1 - CS is de-asserted after transmission/reception of specified number of bytes in the control register" mask="0x400000"/>
          <bitfield name="DDRMODE" caption="SDR_DDR: 0 - SDR mode, 1 - DDR mode. Note: For Michigan Ax versions this bit is Reserved and should be kept 0." mask="0x800000"/>
          <bitfield name="SCHECK" caption="Status Check This bit is mainly used for Programming or Erase operations. 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: For Michigan Ax versions, this bit is Reserved and should be kept 0." mask="0x1000000"/>
          <bitfield name="DEV_SEL_2" caption="SPI Device Select[2]: This field along with SPI DEVICE SELECT [1:0] (bits 21:20) together is used to select a particular SPI device. Bit25 Bit21 Bit20  0 0 0 - SPI Device 0 ,0 0 1 - SPI Device 1 ,0 1 0 - SPI Device 2  ,0 1 1 - SPI Device 3, 1 0 0 - SPI Device 4 ,1 0 1 - SPI Device 5 ,1 1 0 - SPI Device 6 ,1 1 1 - SPI Device 7 Note: For Michigan Ax versions, this bit is Reserved and should be kept 0." mask="0x2000000"/>
        </register>
        <register name="CLKCON" offset="0x110" rw="RW" size="4" initval="0x00000001" caption="SPI Clock Control register">
          <bitfield name="EN" caption="This bit is set to 0 when the SPI Driver is not using the SPI Controller. The SPI  Controller should stop its internal clock to go very low power state. Still, registers  will be able to be read and written. Clock starts to oscillate when this bit is set to 1. When clock oscillation is stable, the SPI Controller will set Internal Clock Stable in this register to 1. 1 - Enable 0 - Disable" mask="0x1"/>
          <bitfield name="STABLE" caption="After Reset, this bit is set to 1 when SPI Clock  is  stable  after  writing  Internal Clock  Enable  in  this  register  to  1. The Clock  Stable  indication  will  continue unless   the   Clock   Divisor   Value   is changed, in which case it will wait until Clock is stable again. Stability is reached when the Clock Divisor period has been reached. The SPI Host Driver should wait until this bit is set to 1 (and the Enable is 1) before programming the SPI Control register. 1 - Stable 0 - Not stable" mask="0x2"/>
          <bitfield name="CLKDIV" caption="SPI Clock Frequency Select 400h - base clock divided by 2048 ,200h - base clock divided by 1024  ,100h - base clock divided by 512 ,080h - base clock divided by 256 ,040h - base clock divided by 128 ,020h - base clock divided by 64 ,010h - base clock divided by 32 ,008h - base clock divided by 16 ,004h - base clock divided by 8 ,002h - base clock divided by 4 ,001h - base clock divided by 2 ,000h - base clock Setting 000h specifies the highest frequency of the SPI Clock. NOTE:  When  DDR  mode  is  active,  the output SPI_CLK is further divided by two (so that internal clocking remains rise edge active internally)  Max output SPI_CLK for DDR is 66Mhz." mask="0x7FF00"/>
        </register>
        <register name="CMDTHR" offset="0x114" rw="RW" size="4" initval="0x00000101" caption="SPI command threshold register">
          <bitfield name="RXCMDTHR" caption="In RX initiation mode, SPI attempts to perform receive fetch operations until RX_CMD_THRES bytes of space remain in the receive buffer. If space for RX_CMD_THRES bytes is not present in the FIFO, then SPI would not initiate any transfer. RX_CMD_THRES should only be programmed when RX is not active, during IDLE or TX. Please note that if S/W performs any reads, thereby reducing the FIFO count, then HW would initiate RX transfer to get back FIFO count equal to RX_CMD_THRES. If S/W would not like any more words latched into FIFO, then command initiation mode needs to be changed to IDLE before any FIFO reads by S/W. In case of Boot/XIP mode, the SPI Controller uses the AHB Burst size, instead of RX CMD Threshold value." mask="0xFF"/>
          <bitfield name="TXCMDTHR" caption="In TX Initiation Mode, SPI Performs a transmit Operation when TX_CMD_THRES bytes are present in the TX FIFO. This should usually be set to 1 for normal flash commands, and is desired to be set to a higher value for page programming. NOTE: Value of 8?d0 should be treated as Reserved (illegal) for this field. May produce unexpected activity on SPI bus. Furthermore, values should generally be limited to EVEN values (excepting a value  of 1), and MUST be so limited in DMA mode." mask="0xFF00"/>
        </register>
        <register name="INTTHR" offset="0x118" rw="RW" size="4" initval="0x00000000" caption="SPI Interrupt Threshold register">
          <bitfield name="RXINTTHR" caption="Receive Interrupt is set when Receive FIFO CNT is larger than or equal to RX_INT_THRES Value." mask="0xFF"/>
          <bitfield name="TXINTTHR" caption="Transmit Interrupt is set when Transmit FIFO has equal or more space than TX_INT_THRES bytes." mask="0xFF00"/>
        </register>
        <register name="INTEN" offset="0x11C" rw="RW" size="4" initval="0x000000AD" caption="SPI Interrupt Enable Register">
          <bitfield name="TXEMPTYIE" caption="TX FIFO Empty Interrupt Enable." mask="0x1"/>
          <bitfield name="TXFULLIE" caption="TX FIFO Full Interrupt Enable." mask="0x2"/>
          <bitfield name="TXTHRIE" caption="Enable Interrupt to be generated when the TX FIFO has space equal to or more than TX_INT_THRES words." mask="0x4"/>
          <bitfield name="RXEMPTYIE" caption="RX FIFO Empty Interrupt Enable." mask="0x8"/>
          <bitfield name="RXFULLIE" caption="RX FIFO Full Interrupt Enable." mask="0x10"/>
          <bitfield name="RXTHRIE" caption="Enable Interrupt to be generated when the RX FIFO has data more than or equal to RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power  on reset, till a read request on the AHB Bus." mask="0x20"/>
          <bitfield name="CONFULLIE" caption="Control Buffer Full Interrupt Enable" mask="0x40"/>
          <bitfield name="CONEMPTYIE" caption="Control Buffer Empty Interrupt Enable" mask="0x80"/>
          <bitfield name="CONTHRIE" caption="Control Buffer Threshold Interrupt Enable" mask="0x100"/>
          <bitfield name="BDDONEIE" caption="Current Buffer Descriptor Interrupt Enable" mask="0x200"/>
          <bitfield name="PKTCOMPIE" caption="Packet completion Interrupt" mask="0x400"/>
          <bitfield name="DMAEIE" caption="Master Error Interrupt Enable" mask="0x800"/>
        </register>
        <register name="INTSTAT" offset="0x120" rw="RW" size="4" initval="0x000000AD" caption="SPI Interrupt Status Register">
          <bitfield name="TXEMPTYIF" caption="TX FIFO Empty Interrupt." mask="0x1"/>
          <bitfield name="TXFULLIF" caption="TX FIFO Full Interrupt." mask="0x2"/>
          <bitfield name="TXTHRIF" caption="Interrupt to be generated when the TX FIFO has space equal to or more than  TX_INT_THRES words." mask="0x4"/>
          <bitfield name="RXEMPTYIF" caption="RX FIFO Empty Interrupt." mask="0x8"/>
          <bitfield name="RXFULLIF" caption="RX FIFO Full Interrupt." mask="0x10"/>
          <bitfield name="RXTHRIF" caption="Interrupt to be generated when the RX FIFO has data more than or equal to  RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power on reset, till a read request on the AHB Bus." mask="0x20"/>
          <bitfield name="CONFULLIF" caption="Control Buffer Full Interrupt" mask="0x40"/>
          <bitfield name="CONEMPTYIF" caption="Control Buffer Empty Interrupt" mask="0x80"/>
          <bitfield name="CONTHRIF" caption="Control Buffer Threshold Interrupt" mask="0x100"/>
          <bitfield name="BDDONEIF" caption="BDP sets this bit to '1' after current buffer descriptor is processed" mask="0x200"/>
          <bitfield name="PKTCOMPIF" caption="Packet completion Interrupt" mask="0x400"/>
          <bitfield name="DMAEIF" caption="Master Error Interrupt" mask="0x800"/>
        </register>
        <register name="TXDATA" offset="0x124" rw="RW" size="4" initval="0x00000000" caption="SPI Transmit Data Register">
          <bitfield name="TXDATA" caption="Data is loaded into this register before being transmitted. Just prior to the beginning of a data transfer, the data in TX_DATA is loaded into the shift register. This register is  used as a window to write data into Transmit buffer." mask="0xFFFFFFFF"/>
        </register>
        <register name="RXDATA" offset="0x128" rw="R" size="4" atomic-op="clear:RXDATA" initval="0x00000000" caption="SPI Receive Data Register">
          <bitfield name="RXDATA" caption="At the end of a data transfer, the data in the shift register is loaded into RX_DATA register. This register is used as a window to read data from Receive buffer." mask="0xFFFFFFFF"/>
        </register>
