Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/atdf/PIC32CK1025SG00064.atdf
        <register name="EPINFO" offset="0x1078" rw="R" size="1" initval="0xFF" caption="Allows Read-Back Of The Number Of TX And RX Endpoints">
          <bitfield name="TXENDPOINTS" caption="number of tx endpoints" mask="0xF"/>
          <bitfield name="RXENDPOINTS" caption="number of rx endpoints" mask="0xF0"/>
        </register>
        <register name="RAMINFO" offset="0x1079" rw="R" size="1" initval="0x8D" caption="Details About Width Of RAM and DMA Channels">
          <bitfield name="RAMBITS" caption="width of the ram address bus" mask="0xF"/>
          <bitfield name="DMACHANS" caption="number of dma channels implemented in the design" mask="0xF0"/>
        </register>
        <register name="LINKINFO" offset="0x107A" rw="RW" size="1" initval="0x5C" caption="Allows Some Delays To Be Specified">
          <bitfield name="WTID" caption="sets the delay to be applied from idpullup being asserted to iddig being considered valid in units of 4.369ms" mask="0xF"/>
          <bitfield name="WTCON" caption="sets the wait to be applied to allow for the user's connect/disconnect filter in units of 533.3ns" mask="0xF0"/>
        </register>
        <register name="VPLEN" offset="0x107B" rw="RW" size="1" initval="0x3C" caption="Sets The Duration Of The VBus Pulsing Charge">
          <bitfield name="VPLEN" caption="duration of VBus pulsing charge in units of 546.1us" mask="0xFF"/>
        </register>
        <register name="HSEOF1" offset="0x107C" rw="RW" size="1" initval="0x80" caption="Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions">
          <bitfield name="HSEOF1" caption="sets for high-speed transactions the time before eof to stop beginning new transactions, in units of 133.3ns. (the default setting corresponds to 17.07us.)" mask="0xFF"/>
        </register>
        <register name="FSEOF1" offset="0x107D" rw="RW" size="1" initval="0x77" caption="Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions">
          <bitfield name="FSEOF1" caption="sets for full-speed transactions the time before eof to stop beginning new transactions, in units of 533.3ns. (the default setting corresponds to 63.46us.)" mask="0xFF"/>
        </register>
        <register name="LSEOF1" offset="0x107E" rw="RW" size="1" initval="0x72" caption="Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions">
          <bitfield name="LSEOF1" caption="sets for low-speed transactions the time before eof to stop beginning new transactions, in units of 1.067us. (the default setting corresponds to 121.6us.)" mask="0xFF"/>
        </register>
        <register name="SOFTRST" offset="0x107F" rw="RW" size="1" initval="0x00" caption="Assert Low The Output Reset Signals NRSTO and NRSTXO">
          <bitfield name="NRST" caption="when a 1 is written to this bit, the output nrsto will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrsto will be asynchronously asserted and synchronously de-asserted with respect to clk." mask="0x1"/>
          <bitfield name="NRSTX" caption="when a 1 is written to this bit, the output nrstxo will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrstxo will be asynchronously asserted and synchronously de-asserted with respect to xclk." mask="0x2"/>
        </register>
        <register-group name="TXFUNADDR" name-in-module="TXFUNADDR" offset="0x1080" size="0x8" count="8"/>
        <register name="DMAINTR" offset="0x1200" rw="RW" size="4" initval="0x00000000" caption="DMA Interrupt Status for Each Channel">
          <bitfield name="DMAINTR" caption="DMA Interrupt for each channel" mask="0xFF"/>
        </register>
        <register-group name="DMACNT" name-in-module="DMACNT" offset="0x1204" size="0x10" count="8"/>
        <register name="RQPKTCOUNT" offset="0x1304" rw="RW" size="4" count="7" initval="0x00000000" caption="Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer">
          <bitfield name="RQPKTCOUNT" caption="sets the number of packets of size maxp that are to be transferred in a block transfer. only used in host mode when autoreq is set. has no effect in peripheral mode or when autoreq is not set." mask="0xFFFF"/>
        </register>
        <register name="RXDPKTBUFDIS" offset="0x1340" rw="RW" size="2" initval="0x0000" caption="Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality">
          <bitfield name="EPxRXDIS" caption="each bit indicates which of the Rx endpoint have disabled double buffer functionality" mask="0xFFFE"/>
        </register>
        <register name="TXDPKTBUFDIS" offset="0x1342" rw="RW" size="2" initval="0x0000" caption="Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality">
          <bitfield name="EPxTXDIS" caption="each bit indicates which of the Tx endpoint have disabled double buffer functionality" mask="0xFFFE"/>
        </register>
        <register name="CTUCH" offset="0x1344" rw="RW" size="2" initval="0x4074" caption="Chirp Timeout. Number Of XCLK Cycles Before The Timeout">
          <bitfield name="CTUCH" caption="this number when multiplied by 4 represents the number of xclk cycles before the timeout occurs" mask="0xFFFF"/>
        </register>
        <register name="CTHHSRTN" offset="0x1346" rw="RW" size="2" initval="0x0032" caption="Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode">
          <bitfield name="CTHHSRTN" caption="the delay from the end of high speed resume signaling to enabling utm normal operating mode." mask="0xFFFF"/>
        </register>
        <register name="CTHSBT" offset="0x1348" rw="RW" size="2" initval="0x0000" caption="This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times.">
          <bitfield name="HSTMEOUTADD" caption="this register represents the value to be added to the mimumum high speed timeout period of 736 bit times" mask="0xF"/>
        </register>
        <register name="LPMATTR" offset="0x1360" rw="RW" size="2" initval="0x0000" caption="Defines The Attributes Of An LPM Transaction And Sleep Cycle.">
          <bitfield name="LINKSTATE" caption="this value is provided by the host to the peripheral to indicate what state the peripheral must transition to after the receipt and acceptance of a lpm transaction." mask="0xF" values="LPMATTR__LINKSTATE"/>
          <bitfield name="HIRD" caption="this is the host initiated resume duration." mask="0xF0"/>
          <bitfield name="RMTWAK" caption="this bit is the remote wakeup enable bit." mask="0x100"/>
          <bitfield name="ENDPOINT" caption="this is the endpnt that in the token packet of the lpm transaction." mask="0xF000"/>
        </register>
        <register name="LPMCNTRL" offset="0x1362" rw="RW" size="1" initval="0x00" caption="LPM Control Register">
          <mode name="HOST" qualifier="USBHS.DEVCTL.HOSTMODE" value="1"/>
          <mode name="PERIPHERAL" qualifier="USBHS.DEVCTL.HOSTMODE" value="0"/>
          <bitfield modes="HOST" name="LPMXMT" caption="software should set this bit to transmit an lpm transaction." mask="0x1"/>
          <bitfield modes="PERIPHERAL" name="LPMXMT" caption="this bit is set by software to instruct the core to transition to the l1 state upon the receipt of the next lpm transaction." mask="0x1"/>
          <bitfield modes="HOST" name="LPMRES" caption="this bit is used by software to initiate a resume from the l1 state" mask="0x2"/>
          <bitfield modes="PERIPHERAL" name="LPMRES" caption="this bit is used by software to initiate resume (remote wakeup)." mask="0x2"/>
          <bitfield modes="PERIPHERAL" name="LPMEN" caption="this register is used to enable lpm in the musbmhdrc." mask="0xC" values="LPMCNTRL__LPMEN"/>
          <bitfield modes="PERIPHERAL" name="LPMNAK" caption="this bit is used to place all end points in a state such that the response to all transactions other then an lpm transaction will be a nak." mask="0x10"/>
        </register>
        <register name="LPMINTREN" offset="0x1363" rw="RW" size="1" initval="0x00" caption="LPM Interrupts Enable Register">
          <bitfield name="LPMSTEN" caption="LPMMST interrupt" mask="0x1"/>
          <bitfield name="LPMNYEN" caption="LPMMNY interrupt" mask="0x2"/>
          <bitfield name="LPMACKEN" caption="LPMACK interrupt" mask="0x4"/>
          <bitfield name="LPMNCEN" caption="LPMNC interrupt" mask="0x8"/>
          <bitfield name="LPMRESEN" caption="LPMRES interrupt" mask="0x10"/>
          <bitfield name="LPMERREN" caption="LPMERR interrupt" mask="0x20"/>
        </register>
        <register name="LPMINTR" offset="0x1364" rw="RW" size="1" initval="0x00" caption="Status Of The LPM Power State">
          <mode name="HOST" qualifier="USBHS.DEVCTL.HOSTMODE" value="1"/>
          <mode name="PERIPHERAL" qualifier="USBHS.DEVCTL.HOSTMODE" value="0"/>
          <bitfield modes="PERIPHERAL" name="LPMST" caption="this bit is set when an lpm transaction is received and the core responds with a stall." mask="0x1"/>
          <bitfield modes="HOST" name="LPMST" caption="this bit is set when an lpm transaction is transmitted and the device responds with a stall." mask="0x1"/>
          <bitfield modes="PERIPHERAL" name="LPMNY" caption="this bit is set when an lpm transaction is received and the core responds with a nyet" mask="0x2"/>
          <bitfield modes="HOST" name="LPMNY" caption="this bit is set when an lpm transaction is transmitted and the device responds with a nyet." mask="0x2"/>
          <bitfield modes="PERIPHERAL" name="LPMACK" caption="this bit is set when an lpm transaction is received and the core responds with an ack." mask="0x4"/>
          <bitfield modes="HOST" name="LPMACK" caption="this bit is set when an lpm transaction is transmitted and the device responds with an ack." mask="0x4"/>
          <bitfield modes="HOST" name="LPMNC" caption="this bit is set when an lpm transaction has been transmitted and has failed to complete." mask="0x8"/>
          <bitfield modes="PERIPHERAL" name="LPMNC" caption="this bit is set when an lpm transaction is received and the core responds with a nyet due to data pending in the rx fifos." mask="0x8"/>
          <bitfield modes="PERIPHERAL" name="LPMRES" caption="this bit is set if the core has been resumed for any reason." mask="0x10"/>
          <bitfield modes="HOST" name="LPMRES" caption="this bit is set when the core has been resumed for any reason." mask="0x10"/>
          <bitfield modes="HOST" name="LPMERR" caption="this bit is set if a response to the lpm transaction is received with a bit stuff error or a pid error" mask="0x20"/>
          <bitfield modes="PERIPHERAL" name="LPMERR" caption="this bit is set if an lpm transaction is received that has a linkstate field that is not supported" mask="0x20"/>
        </register>
        <register name="LPMFADDR" offset="0x1365" rw="RW" size="1" initval="0x00" caption="Function Address In LPM Payload">
          <bitfield name="FUNCADDR" caption="function address that will be placed in the LPM payload" mask="0x7F"/>
        </register>
        <register name="PHY00" offset="0x1500" rw="RW" size="4" initval="0x00000019" caption="USBHPHY Control Register.">
          <bitfield name="PREEMP" caption="enables pre-emphasis" mask="0x7" values="PHY00__PREEMP"/>
          <bitfield name="SLEWRATE" caption="adjust FS/LS slew rate" mask="0x18" values="PHY00__SLEWRATE"/>
          <bitfield name="RXPHSSEL" caption="RX clock phase select" mask="0xE0" values="PHY00__RXPHSSEL"/>
        </register>
        <register name="PHY04" offset="0x1504" rw="RW" size="4" initval="0x0000008F" caption="USBHPHY Control Register.">
          <bitfield name="TXPHSSEL" caption="set the Tx clock phase select" mask="0x3"/>
          <bitfield name="RSVD" caption="Reserved" mask="0x8"/>
          <bitfield name="HIZ" caption="Set D+/D- to a high impedence state" mask="0x10"/>
          <bitfield name="SQUELCH210" caption="Lower 3 bits of RX squelch trigger point configuration" mask="0xE0"/>
        </register>
